//Common
"Cancel" = "Cancel";
"Close" = "Close";
"OK" = "OK";

/* No comment provided by engineer. */
"AnamorphosisSetupUnavailabe" = "Anamorphosis setup is not supported in Free version";

/* No comment provided by engineer. */
"BuyProVersion" = "Buy Pro version";

/* No comment provided by engineer. */
"Facebook" = "Facebook";

"FacebookNotInstalled" = "Please install Facebook in Settings";

/* No comment provided by engineer. */
"ProductFanArts" = "Fan Arts";

/* No comment provided by engineer. */
"ProductIntroduction" = "Homepage";

/* No comment provided by engineer. */
"ProductUserManual" = "Tutorial";

/* No comment provided by engineer. */
"ProductSupport" = "Community";

"ProductBetaTestFeedback" = "Test Feedback";

/* No comment provided by engineer. */
"SinaWeibo" = "Weibo";

"SinaWeiboNotInstalled" = "Please install Sina Weibo in Settings";

/* No comment provided by engineer. */
"Twitter" = "Twitter";

"TwitterNotInstalled" = "Please install Twitter in Settings";


//Import Export
"Photo" = "Photo";

"Camera" = "Camera";

"Email" = "Email";

"PostToFacebookMessage" = "Paint amazing 3D Street Painting is nothing with ProjectPaint!";

"PostToTwitterMessage" = "Paint amazing 3D Street Painting is nothing with ProjectPaint!";

"PostToSinaWeiboMessage" = "Paint amazing 3D Street Painting is nothing with ProjectPaint!";

"EmailMessageSubject" = "With AnaDraw, everyone can be an Anamorphosis Artist";
"EmailMessageBody" = "<div>Dear Friend,<br>    See what I have created. It is called Anamorphosis Art.<br> With <a href=\"http://www.dreapp.com/anadraw\">AnaDraw</a>, everyone can be an Anamorphosis Artist! </div>";

"MessageSubject" = "With AnaDraw, everyone can be an Anamorphosis Artist";
"ShareMessageBody" = "See what I have created. It is called Anamorphosis Art. With AnaDraw, everyone can be an Anamorphosis Artist!";

"MailAccountNotAvailabel" = "Please add your mail account in mail settings";

//swatches
"Aggressive" = "Aggressive";
"Ancient" = "Ancient";
"Attractive" = "Attractive";
"Balanced" = "Balanced";
"Baroque" = "Baroque";
"Blazing" = "Blazing";
"Calm" = "Calm";
"Casual" = "Casual";
"Charming" = "Charming";
"Clean" = "Clean";
"Cooling" = "Cooling";
"Creative" = "Creative";
"Cute" = "Cute";
"Dangerous" = "Dangerous";
"Dear" = "Dear";
"Delightful" = "Delightful";
"Dismal" = "Dismal";
"Dreamy" = "Dreamy";
"Dry" = "Dry";
"Elaborate" = "Elaborate";
"Empty" = "Empty";
"Erotic" = "Erotic";
"Even" = "Even";
"Expressive" = "Expressive";
"Fascinating" = "Fascinating";
"Fashionable" = "Fashionable";
"Flat" = "Flat";
"Flawless" = "Flawless";
"Fragrant" = "Fragrant";
"Free" = "Free";
"Full" = "Full";
"Funny" = "Funny";
"Happy" = "Happy";
"Hard" = "Hard";
"Healthy" = "Healthy";
"Heavy" = "Heavy";
"HighTech" = "HighTech";
"Horrid" = "Horrid";
"Hot" = "Hot";
"Huge" = "Huge";
"IceCold" = "IceCold";
"Infinite" = "Infinite";
"Innovation" = "Innovation";
"Light" = "Light";
"Lovely" = "Lovely";
"Magical" = "Magical";
"Maximum" = "Maximum";
"Minimal" = "Minimal";
"Moist" = "Moist";
"Mystic" = "Mystic";
"Nebulous" = "Nebulous";
"Noble" = "Noble";
"OldFashioned" = "OldFashioned";
"Oriental" = "Oriental";
"Outdated" = "Outdated";
"Paradisiacal" = "Paradisiacal";
"Passionate" = "Passionate";
"Powerful" = "Powerful";
"Pretty" = "Pretty";
"Priceless" = "Priceless";
"Professional" = "Professional";
"Pure" = "Pure";
"Qualitative" = "Qualitative";
"Quiet" = "Quiet";
"Raw" = "Raw";
"Relaxed" = "Relaxed";
"Sad" = "Sad";
"Safe" = "Safe";
"Sexy" = "Sexy";
"Shapely" = "Shapely";
"Simple" = "Simple";
"Smooth" = "Smooth";
"Soft" = "Soft";
"Solid" = "Solid";
"Sophisiticated" = "Sophisiticated";
"Spirited" = "Spirited";
"Splendid" = "Splendid";
"Static" = "Static";
"Stuffy" = "Stuffy";
"Stylish" = "Stylish";
"Sweet" = "Sweet";
"Symbolic" = "Symbolic";
"Tiny" = "Tiny";
"Traditional" = "Traditional";
"Velvety" = "Velvety";
"Visionary" = "Visionary";
"Wide" = "Wide";
"WornOut" = "WornOut";
"Young" = "Young";

//Layer
"ReversePaintRefLayerLocked" = "Operation on reference image is disabled";
//blend
"Normal" = "Normal";
"Multiply" = "Multiply";
"Screen" = "Screen";
"Overlay" = "Overlay";
"Darken" = "Darken";
"Lighten" = "Lighten";
"ColorDodge" = "ColorDodge";
"ColorBurn" = "ColorBurn";
"SoftLight" = "SoftLight";
"HardLight" = "HardLight";
"Difference" = "Difference";
"Exclusion" = "Exclusion";
"Hue" = "Hue";
"Saturation" = "Saturation";
"Color" = "Color";
"Luminosity" = "Luminosity";

//IAP
"IAPUnavailableByJailbreakDevice" = "jailbreak device can not buy product.";

"IAPUnavailableByNoInternetAccess" = "No access to AppStore.Please check your internet and try later.";

"IAPUnavailableByDevice" = "InAppPurchase disabled by device.";

"IAPUnavailableByRetreiveProductsFailure" = "Get products from AppStore failed. Please try later.";

"BrushIAP" = "This brush is not supported in Free version.";
"LayersIAP" = "layers supported in Pro version.";
"LayersFree" = "layers supported in Free version.";
"LayersAvailable" = "layers supported";
"ReverseLayersAvailable" = "layers including normal layers supported";
"SwatchIAP" = "swatch manager not supported in Free version.";
"Pro Version" = "Pro Version";
"ThankForPurchase" = "Thanks for purchasing AnaDraw Pro.\n Pro features are unlocked.\nAnaDraw will continue to be better.\n\nNow creating the illusion work is on your hand!";

"ProductFeatureTitle0" = "Reverse Draw";
"ProductFeatureDescription0" = "Draw on anamorphed image \nPowerful tool to create illusion artwork";
"ProductFeatureTitle1" = "Crayons";
"ProductFeatureDescription1" = "Doodle with casual";
"ProductFeatureTitle2" = "Finger";
"ProductFeatureDescription2" = "Smudge like real";
"ProductFeatureTitle3" = "Marker";
"ProductFeatureDescription3" = "Mark idea quickly";
"ProductFeatureTitle4" = "Airbrush";
"ProductFeatureDescription4" = "Control pressure precisely";
"ProductFeatureTitle5" = "Zen Brush";
"ProductFeatureDescription5" = "Splash color with zen style";
"ProductFeatureTitle6" = "Oil Brush";
"ProductFeatureDescription6" = "Paint nice strokes";
"ProductFeatureTitle7" = "Word Pallete";
"ProductFeatureDescription7" = "Hundreds of color palletes with key word\nCreate your color style with ease";

"Purchased" = "Purchased";

//reverse draw
//"ReverseDraw" = "Reverse Draw";
//"Draw" = "Draw";

//brush name
"Pencil" = "Pencil";
"Crayons" = "Crayons";
"Pen" = "InkPen";
"InkPen" = "BallPen";
"Eraser" = "Eraser";
"Bucket" = "Bucket";
"Marker" = "Marker(Round)";
"MarkerSquare" = "Marker(Hard)";
"Finger" = "Finger";
"OilBrush" = "OilBrush";
"ChineseBrush" = "ChineseBrush";
"AirBrush" = "AirBrush";

//brush property
"Property" = "Property";
"Noise" = "Noise";
"Fade" = "Fade";
"Radius" = "Radius";
"Opacity" = "Opacity";
"Flow" = "Flow";
"Angle" = "Angle";
"Round" = "Round";
"Hard" = "Hard";
"Spacing" = "Spacing";
"Scatter" = "Scatter";
"Wet" = "Wet";
"Dither" = "Dither";
"AirBrush" = "AirBrush";
"VelSensor" = "VelSensor";

//tutorial
"TutorialListTitleLabel" = "Follow Tutorials";
"TutorialListButtonLabel0" = "Basics of Anamorphosis";
"TutorialListButtonLabel1" = "Basics of AnaDraw";
"TutorialListButtonLabel2" = "Edit before Drawing";
"TutorialListButtonLabel3" = "How to Draw Image on Reflection";
"TutorialListButtonLabel4" = "How to Draw Image on Anamorphosis";

"TutorialAnamorphosisIntroduction0" = "What is anamorphosis";
"TutorialAnamorphosisIntroduction1" = "A deformed image appears in its true shape";
"TutorialAnamorphosisIntroduction2" = "Only when viewed in some magical way";
"TutorialAnamorphosisIntroduction3" = "It has a long history from late Renaissance";
"TutorialAnamorphosisIntroduction4" = "Loved by great artists like Salvador Dali";
"TutorialAnamorphosisIntroduction5" = "Now people all love this fashionable visual art";
"TutorialAnamorphosisIntroduction6" = "Creating magical illusion art is not impossible";

"TutorialAnamorphosisSlogan0" = "Do You Wannaa Draw! it";
"TutorialAnamorphosisSlogan1" = "You Do Want anaDraw !";

"TutorialAnamorphosisLifeArt0" = "Coasters";
"TutorialAnamorphosisLifeArt1" = "Mouse Pad";
"TutorialAnamorphosisLifeArt2" = "Postcard";
"TutorialAnamorphosisLifeArt3" = "Mac Pad";

"TutorialAnamorphosisInLife0" = "Everyone can draw these with AnaDraw";
"TutorialAnamorphosisInLife1" = "Put your illusion art into life";

"TutorialStart" = "Start Tutorial";
"TutorialNext" = "Next";
"TutorialEnd" = "Tutorial Done";

"TutorialWelcome" = "Welcome to Art of Anamorphosis";
"ByIstvanOrosz" = "By Istvan Orosz";
"PaintCollectionWelcome" = "AnaDraw is a drawing app which allow you to draw anamorphic images.\n\nLearn how to use the powerful tools to view and draw by following tutorials.\n\nYou will create unbelievable illusion.";
"PaintCollectionPickImage" = "[PICK] your image.";
"CylinderProjectNextImage" = "[PAN LEFT or RIGHT] in the area of anamorphic image to browse images.";
//"CylinderProjectPreviousImage" = "PAN RIGHT in the area of anamorphic image to view previous image.";
"CylinderProjectSetup" = "[CLICK HERE] to edit the shape of anamorphosis.";
"CylinderProjectSetupScene" = "[CLICK HERE] to select the reference of the cylindrical mirror in life.";
"CylinderProjectSetupSceneDone" = "[CLICK HERE] to pick up the reference object you want to use.";
"CylinderProjectPutDevice" = "[CLICK HERE] to view image in top perspective.";
"CylinderProjectViewDevice" = "[PLACE] a full reflective object which fits into the circle.You will see the image on the surface of the object.\n\nScreen brightness is auto adjusted to maximum.";
"CylinderProjectViewDeviceDone" = "If you don't have the reference object, AnaDraw provides virtual mirror.\n\n[CLICK HERE] to view image on the virtual mirror.";
"CylinderProjectSetupValue" = "[SLIDE HERE] to change value.";
"CylinderProjectSetupCylinderDiameter" = "[CLICK NUMBER] to change diameter of the cylinder.";
"CylinderProjectSetupCylinderHeight" = "[CLICK NUMBER and DRAG SLIDER] to change height of the cylinder.";
"CylinderProjectSetupImageWidth" = "[CLICK NUMBER and DRAG SLIDER] to change width of the reflected image.";
"CylinderProjectSetupImageCenter" = "[CLICK NUMBER and DRAG SLIDER] to change center of the reflected image.";
"CylinderProjectSetupZoom" = "[CLICK NUMBER and DRAG SLIDER] to zoom if you can't see the whole image.\n\nWidth and Height show actual dimension of the screen region when exporting the image for print.\n\nZoomed image in iPad is distorted on the mirror.";
"CylinderProjectSetupZoomReversePaint" = "[CLICK NUMBER and DRAG SLIDER] to zoom the image to fit in screen.";
"CylinderProjectSetupZoomFixDisplay" = "[CLICK NUMBER and DRAG SLIDER] to zoom until the reflected image is not clipped.";
"CylinderProjectSetupEyeZoom" = "[CLICK NUMBER and DRAG SLIDER] to zoom the distance between eye and the cylinder.";
//"CylinderProjectSetupEyeDistance" = "[CLICK NUMBER and DRAG SLIDER] to change horizontal distance between eye and bottom center of the mirror";
//"CylinderProjectSetupEyeHeight" = "[CLICK NUMBER and DRAG SLIDER] to change vertical distance between eye and bottom center of the mirror";
"CylinderProjectTopViewForZoom" = "[CLICK HERE] to view from top perspective to see the actual dimension of the region.";
"CylinderProjectSideViewForEye" = "[CLICK HERE] to view from eye perspective before you change your view angle.";
"CylinderProjectCloseSetup" = "[CLICK HERE] to save or restore when you finish playing anamorphosis. \n\nIn browsing mode, all parameters are restored to default.";
//"CylinderProjectCloseSetupSave" = "[CLICK HERE] to confirm your modification for parameters before continue to draw.";
"CylinderProjectTopViewForPaint" = "[CLICK HERE] to draw from top perspective.";
"CylinderProjectTopViewForPaintDetail" = "Paint on anamorphic image is a powerful tool, by which you can draw anamorphosis back and forth.";
"CylinderProjectSideViewForPaint" = "Before that, [CLICK HERE] to draw on surface of the cylinder.";
"CylinderProjectPaint" = "[CLICK HERE] to draw image in the reflection.\nNow, let's start to DRAW!";
"CylinderProjectReversePaint" = "[CLICK HERE] to draw on anamorphic image.\nNow, let's CREATE illusion!";
"CylinderProjectTutorialDone" = "Learn More";
"PaintScreenHelpTips" = "[CLICK HERE] to view \nquick help";
"PaintScreenHelpMainBrush" = "Using Brush";
"PaintScreenHelpSecondBrush" = "Second Brush";
"PaintScreenHelpBrushRadius" = "Radius";
"PaintScreenHelpBrushOpacity" = "Opacity";
"PaintScreenHelpBrushColor" = "Using Color";
"PaintScreenHelpPalleteColor" = "Swatch";
"PaintScreenHelpPalleteMore" = "Swatches";
"PaintScreenHelpFullScreen" = "FullScreen";

"PaintScreenTutorialDone" = "Learn More";
"PaintScreenCloseDoc" = "[CLICK HERE] to exist when you finish drawing";
"PaintScreenAnamorphosisTips" = "Drawing region where only in the shape will be saved and transformed to reflection";
"QuickGestures" = "Quick Gestures";
"tutorial_gesture1FingerDrag" = "Tap or Drag \nDraw Color on Canvas";
"tutorial_gesture1FingerTapHold" = "Tap and Hold \nPick Color on Canvas";
"tutorial_gesture2FingerDrag" = "2 Finger Drag \nMove Canvas";
"tutorial_gesture2FingerRotate" = "2 Finger Rotate \nRotate Canvas";
"tutorial_gesture2FingerPinch" = "2 Finger Pinch \nZoom in Canvas";
"tutorial_gesture2FingerSpread" = "2 Finger Spread \nZoom out Canvas";
"tutorial_gesture2FingerDoubleTap" = "2 Finger Double Tap \nReset Canvas";
"tutorial_gesture3FingerUp" = "3 Finger Drag Up \nEdit Layer";
"tutorial_gesture3FingerDown" = "3 Finger Drag Down \nEdit Color";
"tutorial_gesture3FingerLeft" = "3 Finger Drag Left \nUndo";
"tutorial_gesture3FingerRight" = "3 Finger Drag Right \nRedo";
"tutorial_gesture3FingerZ" = "3 Finger Drag Z \nClear";

//misc
"NoAccessPhotoLibrary" = "Error accessing photo library!";
"InvalidImageWarning" = "import invalid images";
"ClearAllLayersWarning" = "Your work will be cleared and never be restored again. Are you sure?";
"DontSave" = "Don't Save";
"Save" = "Save";
"Restore" = "Restore";
"SaveUserInputParams" = "Save the shape for this image?";

//share
"RealWidth" = "Image Width";
"RealHeight" = "Image Height";
"DeviceDiameter" = "Cylindrical Mirror Diameter";

//beta test
"BetaTestQuestion1" = "Can you understand how to use anamorphic functions after reading over tutorial?";
"BetaTestQuestion2" = "Is the tutorial too long?";
"BetaTestQuestion3" = "Is drawing process smooth?";
"BetaTestQuestion4" = "Is the brushs act as what you expect?";
"BetaTestQuestion5" = "Is the count of undo too less?";
"ThankYouForFeedback" = "Thank you for testing AnaDraw. Please give us suggestions here.";
